# Python 的基本数据类型

# 1.字符串
str1 = 'a'
str2 = "a"
str3 = '''a'''
print(str1)
print(str2)
print(str3)


# 2.整数  整数英文为 integer 。代码中的整数跟我们平常认识的整数一样，包括正整数、负整数和零，是没有小数点的数字。
int1 = 1
int2 = 100
int3 = -800
int4 = 0
int5 = 1 / 2
print(int1)
print(int2)
print(int3)
print(int4)
print(type(int5))
# https://camo.githubusercontent.com/e720b8f942552159ef9e568428920733827a2b26daf30c3785303a50c2d9c96e/687474703a2f2f74776f7761746572696d6167652e6f73732d636e2d6265696a696e672e616c6979756e63732e636f6d2f323031392d30382d33302d3033343533382e706e67

print("===========================================")
# 3.浮点数
print(0.55+0.41)
print(0.55+0.4)
print(0.55+0.411)
# 对于第一个还好，0.55+0.41 等于 0.96 ，运算结果完全一致。可是后面两个，你会发现怎么出现了那么多个零。
# 这是因为计算机对浮点数的表达本身是不精确的。保存在计算机中的是二进制数，二进制对有些数字不能准确表达，只能非常接近这个数。
# 所以我们在对浮点数做运算和比较大小的时候要小心。